import React, { Component } from 'react'
// import donate from '../images/maruza1.mp4'
// import donate1 from '../images/maruza2.mp4'
import '../styles/video.css'

class video extends Component {
  render() {
    return (
      <div className="container">
        <div className='video_content'>
          <h1 className='video_title'>/ Biz haqimizda</h1>
          <h3 className='video_cl'>Eng so'nggi yangiliklar</h3>
          <span className='text_news'>СОЛИҲА АЁЛ ОЛАМНИ ОБОД ЭТАДИ</span>
          <p className='video_text'>
Машойихларимиз айтадилар: “Эркак солиҳа аёл туфайли обрў-иззат топади, хонадон оқила аёл сабабли обод бўлади. Гарчи уй эгаси пайғамбар бўлса ҳам, ёмон аёл туфайли хонадон барбод бўлади”. Бизнинг тилимизда бу ҳикматли сўз: “Эрни эр қиладиган ҳам, қаро ер қиладиган ҳам хотиндир”, деган иборага тўғри келади. Дарҳақиқат, уй бекасининг оқила, доно бўлиши ҳар жиҳатдан бахт ва саодатдир. Бунга мисол тариқасида улуғ Занги ота ва Анбар онани келтириш мумкин.Занги ота 25 ёшга кирганида Хоразмшоҳнинг 40 ёшли қизи Анбар онага уйланади ва Тошкент вилоятида яшайди. Бу зот нақшбандия ва яссавия тариқатини пухта ўзлаштиради. У Ўрта Осиё бўйлаб исломни тарғибот қилган. Асл касби чўпон бўлган Занги ота маҳалладошларининг чорвасини боқиб элдошлари хизматида бўлади.
Занги ота фарзандсиз ўтган ва тахминан 86 ёш умр кўрган. Унинг аёли Анбар она Хоразмшоҳ  Бўғрохоннинг (ХII асрнинг охирлари) қизи эди. Шоҳ ўз қизини Сулаймон ота (Ҳаким ота, Занги отанинг устози)га турмушга беради. Улар 3 нафар ўғил кўрадилар. Бироқ Ҳаким ота ёшлигида вафот этади. Ўлимидан олдин ўғилларига васият қилади: “Болаларим, вафотимдан кейин мени 40 нафар авлиё йўқлаб келади. Улар орасида бўйи баланд, қўлларида асо бор авлиё ҳам бўлади. Онангизни шунга турмушга узатинглар”, – деган.
Занги ота устозининг васиятига кўра ўзларидан ўн беш ёш катта, уч болали аёлга уйланади. Шоҳнинг қизи бўлишига қарамай, Анбар она авлиё Занги отанинг хизматини қилган ва дуосини олган. Анбар онанинг ўзи доялик қилиб, элга хизмат қилган. У покизалиги, покдомонлиги, хулқу одоби билан барча аёлларга ибрат бўлган.
Анбар она ва Занги ота тахминан ХIII аср охирларида бир йил фарқ билан вафот этишган. Анбар она мисолида солиҳа аёл оламни обод этишини англаймиз. Солиҳа аёл диннинг ярмидир. Солиҳа аёл дунё матоларининг энг яхшисидир. Абдуллоҳ ибн Амр розияллоҳу анҳудан ривоят қилинади. Пайғамбаримиз соллаллоҳу алайҳи ва саллам: “Дунё бир матодир. Дунё матоларининг энг яхшиси солиҳа аёлдир”, деганлар (Имом Муслим ривояти).
Имом Ҳоким “Мустадрак”ида Анас розияллоҳу анҳудан ривояти қилади. Набий алайҳиссалом: “Кимга Аллоҳ таоло солиҳа аёл насиб этган бўлса, Аллоҳ унинг динининг ярмига ёрдам берибди. Қолган ярмида Аллоҳдан тақво қилсин”, деганлар.
Солиҳа аёлнинг зийнати хусусида Абу Нуъайм бундай дейди: «Саид ибн Мусаййибнинг аёли, “Биз ўз эрларимизга, сизлар ўз амирларингизга сўзлагандек, “Аллоҳ сизни салоҳиятли қилсин, Аллоҳ сизни саломат қилсин”, деб айтар эдик”, дейди».
Меҳрибон ва мушфиқ она – оилавий роҳат-фароғат ва сокинлик манбаи бўлиб, ўзининг меҳр-шафқати билан оила аъзоларининг дилларию кўзларини қувнатувчи шамчироқдир. Ҳақиқатан, аёли меҳрибон, ширинсўз, вафодор бўлган эркак имкон қадар тезроқ уйига – оиласи бағрига қайтишга ошиқади. Фарзандлар ҳам ўқиш, машғулотлардан сўнг меҳрибон оналарининг бағрига талпинишади. Аёл вафодор қаллиғ, меҳрибон она бўлиб, оила аъзоларининг парвариши ва тарбияси учун қанчалик кўп эътибор берса, худди оҳанрабодек уларни доимо ўзига тортиб туради. Бундай аёлга эга бўлган хонадон энг бахтиёр ва тинч оила ҳисобланади.
Орамизда мансаб-мартаба эгаллаш ёки обрў-эътибор қозониш ёки ҳусну жамоли билан бошқаларни лол қолдириш орзусида елиб-югураётган аёл-қизлар ҳам йўқ эмас. Афсуски, улар ўз бахтларини кўчадан топмоқчи бўлишади. Оқибатда эса бахт деб югурганлари сароб бўлиб чиқади. Чунки улар ҳақиқий бахтлари – оиладаги ўринларини қандайдир арзимас нарсаларга алишишганди. Агар улар ўзларини фарзандларни яхши парваришлаб, соғлом, зийрак ва одобли қилиб тарбиялашга бағишлаганларида нафақат ўзлари, балки жамият, давлат учун жуда ҳам катта фойда келтирган бўларди.
Инсоннинг ҳалол, фидойи, олижаноб, омонатдор бўлиб вояга етиши оилавий муҳитга чамбарчас боғлиқ. Бола ҳеч қачон ўзидан-ўзи жамият, халқ учун керакли инсон бўлиб етишмайди. Бунинг учун ота-онанинг меҳр-муҳаббати, эътибори, таълим-тарбияси зарур. Бу масалада оналарнинг ўрнини ҳеч нарса билан қиёслаб бўлмайди.


 </p>

          {/* <video className='video_mosque' controls >
            <source src={donate} type="video/mp4" />
          </video>
          <video className='video_mosque' controls >
            <source src={donate1} type="video/mp4" />
          </video> */}
        </div>
      </div>
    );
  }
}

export default video;