import React, { Component } from 'react'
// import donate from '../images/maruza1.mp4'
// import donate1 from '../images/maruza2.mp4'
import '../styles/video.css'

class video extends Component {
  render() {
    return (
      <div className="container">
      <div className='video_content'>
      <h1 className='video_title'>/ О нас</h1>
      <h3 className='video_cl'> Последние новости</h3>
      <span className='text_news'>ХОРОШАЯ ЖЕНЩИНА УЛУЧШАЕТ МИР</span>
      <p className='video_text'>
Наши преданные говорят: «Мужчина обретает уважение благодаря праведной женщине, а семья процветает благодаря мудрой женщине». Даже если хозяин дома пророк, из-за дурной женщины дом будет разрушен». В нашем языке этому мудрому слову соответствует фраза: «Жена делает мужа мужем, а жена, которая делает мужа черным». На самом деле быть умной и мудрой домохозяйкой — это счастье и блаженство во всех отношениях. Пример тому - отец Занги и мать Анбар. Когда отцу Занги исполнилось 25 лет, он женился на матери Анбар, 40-летней дочери хорезмшаха, и жил в Ташкентской области. Эта порода основательно ассимилирует секты Накшбандия и Яссавия. Он распространял ислам по всей Средней Азии. Отец Занги, чья первоначальная профессия была пастухом, служил своим друзьям, заботясь о домашнем скоте своих соседей. Отец Занги был бездетным и прожил около 86 лет. Его жена Анбар была дочерью хорезмшаха Богрохана (конец 12 в.). Царь выдает свою дочь замуж за отца Соломона (отца Хакима, наставника отца Занги). У них 3 сына. Однако отец Хакима умирает в молодом возрасте. Перед смертью он завещал своим сыновьям: "Дети мои, после моей смерти меня посетят 40 святых. Среди них будет высокий святой с посохом в руках. Выдайте за него замуж свою мать". своего отца, Занги женится на женщине, которая старше его на пятнадцать лет и имеет троих детей. Несмотря на то, что она была дочерью царя, мать Анбар служила и получила благословение святого отца Занги. Сама мать Анбар служила повивальной бабкой. пример для всех женщин своей чистотой,непорочностью и манерами.Мать Анбар и отец Занги умерли с разницей примерно в год в конце 13 века.На примере Матери Анбар мы понимаем,что праведная женщина улучшает мир.А праведная женщина - половина религии. Добродетельная женщина - лучшая из одежд мира. Рассказал Абдуллах ибн Амр, да будет доволен им Аллах. Наш Пророк, да благословит его Аллах и приветствует, сказал: "Мир является тканью. Лучшая из одежд мира – добродетельная женщина» (передал имам Муслим). Имам Хоким передает от Анаса в его «Мустадраке». Пророк, мир ему и благословение, сказал: «Кого Аллах благословил праведной женщиной , Аллах помог ему с половиной его религии. А в оставшейся половине пусть боится Аллаха». Относительно украшения праведной женщины Абу Нуайм говорит: «Жена Саида ибн Мусайиба сказала: «Мы говорили нашим мужьям, как вы говорите своим эмирам: «Пусть Да укрепит тебя Аллах, да пошлет Аллах тебе здоровье». Добрая и любящая мать – источник семейного счастья и мира, свеча, радующая сердца и глаза членов семьи своей добротой. добрый,милый и верный поспешит вернуться домой к своей семье как можно скорее.После учебы и обучения дети тоже пойдут в объятия своих любящих матерей.Женщина верная,любящая мать,и чем больше она уделяет внимание заботе и воспитанию членов своей семьи, тем более она всегда притягивает их к себе, как рабыня. Домохозяйство с такой женщиной - самая счастливая и мирная семья. Среди нас есть женщины и девушки, которые убегают с мечтают получить положение или завоевать престиж или поразить окружающих своей красотой.К сожалению, они хотят найти свое счастье на улице. В конце концов то, что они считали счастьем, оказалось миражом. Потому что они променяли свое настоящее счастье — свое место в семье — на какие-то пустяки. Если бы они посвятили себя заботе о своих детях, воспитанию их здоровыми, умными и вежливыми, то принесли бы большую пользу не только себе, но и обществу и государству. То, что человек вырастает честным, самоотверженным, благородным и верным, тесно связано с семейным окружением. Ребенок никогда сам по себе не станет необходимой личностью для общества и нации. Для этого необходимы родительская любовь, внимание и воспитание. Позицию матерей в этом вопросе нельзя ни с чем сравнить.
</p>
      {/* <video  className='video_mosque' controls >
      <source src={donate} type="video/mp4"/>
     </video>
     <video className='video_mosque' controls >
            <source src={donate1} type="video/mp4" />
          </video> */}
      </div>
      </div>
    );
  }   
}

export default video;